//--------------------------------------------------------------------------------
//5. Асимптотическая сложность
//--------------------------------------------------------------------------------
// Выберите асимптотическую сложность этого алгоритма:

function algorithm(arr) {
    const n = arr.length;

    let result = 0;
    for (let i = 0; i < n; i++) {
        for (let j = i + 1; j < n; j++) {
            result += arr[i] * arr[j];
        }
    }

    let power = 1;

    while (power <= n) {
        power *= 2;
    }

    return [result, power / 2];
}


//1) O(nlog(n))
//2) O(n^2) + O(log(n))
//3) O(log(n)) + O(n)
//4) O(n^2) + O(n) 